Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: For example, you already cannot use the words empty and default this way, since they are special reserved keywords.
es: Se pueden "rellenar" arrays multidimensionales de muchas formas, pero la más difícil de comprender es cómo usar el comando array() para arrays asociativos.

source: See the above examples for details on why as well as the section on variable parsing in strings.
es: Estos dos trozos de código rellenarán el array unidimensional de la misma manera:

source: If you convert an object If you convert an object to an array, you get the properties (member variables) of that object as the array's elements.
es: # Ejemplo 1: $a[ "color"] = "rojo"; $a["sabor"] = "dulce"; $a["forma"] = "redondeada"; $a["nombre"] = "manzana"; $a[3] = 4; # Example 2: $a = array ("color "= "rojo", "sabor" = "dulce", "forma "= "redondeada", "nombre" = "manzana", 3 = 4);

source: Array ([0] = RED [1] = BLUE [2] = GREEN [3] = YELLOW) * /?
es: La función array() se puede anidar para arrays multidimensionales:

source: ?php $arr1 = array( 2, 3); $arr2 = $arr1; $arr2[] = 4; / / $arr2 is changed, / / $arr1 is still array(2,3) $arr3 = $arr1; $arr3[] = 4; / / now $arr1 and $arr3 are the same?
es: ? $a = array( "manzana "= array ("color" = "rojo", "sabor "= "dulce", "forma" = "redondeada "), "naranja" = array ("color "= "naranja", "sabor" = "ácido", "forma "= "redondeada"), "plátano "= array ("color" = "amarillo", "sabor "= "paste-y", "forma" = "aplatanada ")); echo $a["manzana"]["sabor"]; # devolverá "dulce"?

source: Strings
es: Cadenas

source: Objects
es: Objetos

source: ?php $a = 1.234; $b = 1.2e3; $c = 7E-10;?
es: Los números en punto flotante ("double") se pueden especificar utilizando cualquiera de las siguientes sintaxis:

source: This can lead to confusing results: for example, floor( (0.1+0.7)*10) will usually return 7 instead of the expected 8 as the result of the internal representation really being something like 7.9999999999....
es: $a = 1.234; $a = 1.2e3;

source: Four scalar types:
es: PHP soporta los siguientes tipos:

source: string
es: números en punto flotante

source: object
es: entero

source: number
es: cadena

source: The type of a variable is usually not set by the programmer; rather, it is decided at runtime by PHP depending on the context in which that variable is used.
es: El tipo de una variable normalmente no lo indica el programador; en su lugar, lo decide PHP en tiempo de ejecución dependiendo del contexto en el que se utilice esa variable.

source: If you want to check out the type and value of a certain expression, use var_dump().
es: Si se quisiese obligar a que una variable se convierta a un tipo concreto, se podría forzar la variable o usar la función settype() para ello.

source: If you simply want a human-readable representation of the type for debugging, use gettype().
es: Nótese que una variable se puede comportar de formas diferentes en ciertas situaciones, dependiendo de qué tipo sea en ese momento.

source: Some examples:
es: Para más información, vea la sección Conversión de Tipos.

source: If you would like to force a variable to be converted to a certain type, you may either cast the variable or use the settype() function on it.
es: Los enteros se puede especificar usando una de las siguientes sintaxis:

source: For more information, see the section on Type Juggling.
es: $a = 1234; # número decimal $a = -123; # un número negativo $a = 0123; # número octal (equivalente al 83 decimal) $a = 0x12; # número hexadecimal (equivalente al 18 decimal)

source: Booleans
es: Números en punto flotante

source: ?php class foo {function do_foo() {echo "Doing foo .";}} $bar = new foo; $bar - do_foo();?
es: Para inicializar un objeto, se usa la sentencia new para instanciar el objeto a una variable.

source: If a value of any other type is converted to an object, a new instace of the stdClass built in class is created.
es: class foo {function do_foo () {echo "Doing foo .";}} $bar = new foo; $bar - do_foo();

source: Resource
es: Type juggling

source: A string literal can be specified in three different ways.
es: Las cadenas de caracteres se pueden especificar usando uno de dos tipos de delimitadores.

source: To specify a literal single quote, you will need to escape it with a backslash (\), like in many other languages.
es: Si la cadena está encerrada entre dobles comillas ("), las variables que estén dentro de la cadena serán expandidas (sujetas a ciertas limitaciones de interpretación).

source: Note that if you try to escape any other character, the backslash will also be printed!
es: Como en C y en Perl, el carácter de barra invertida ("\") se puede usar para especificar caracteres especiales:

source: ?php echo 'this is a simple string'; echo'You can also have embedded newlines in strings this way as it is okay to do'; / / Outputs: "I'll be back "echo'Arnold once said: "I\'ll be back"'; / / Outputs:
es: secuencia

source: You deleted C:\*.*? echo 'You deleted C:\*.* ?'; / / Outputs:
es: significado

source: Table 7-1.
es: Nueva línea

source: horizontal tab (HT or 0x09 (9) in ASCII)
es: Retorno de carro

source: Again, if you try to escape any other character, the backslash will be printed too!
es: Tabulación horizontal

source: One should provide an identifier after, then the string, and then the same identifier to close the quotation.
es: Barra invertida

source: It is very important to note that the line with the closing identifier contains no other characters, except possibly a semicolon (;).
es: Signo del dólar

source: If in this case a proper closing identifier is not found then a parse error will result with the line number being at the end of the script.
es: Comillas dobles

source: Variables are expanded, but the same care must be taken when expressing complex variables inside a here doc as with strings.
es: la secuencia de caracteres que coincida con la expresión regular es un carácter en notación octal

source: This should print a capital 'A': \x41 EOT;?
es: la secuencia de caracteres que coincida con la expresión regular es un carácter en notación hexadecimal

source: There are two types of syntax, a simple one and a complex one.
es: Se puede proteger cualquier otro carácter, pero se producirá una advertencia en el nivel de depuración más alto.

source: The complex syntax was introduced in PHP 4, and can be recognised by the curly braces surrounding the expression.
es: La segunda forma de delimitar una cadena de caracteres usa el carácter de comilla simple ("'").

source: Enclose the variable name in curly braces if you want to explicitly specify the end of the name.
es: Cuando una cadena va encerrada entre comillas simples, los únicos caracteres de escape que serán comprendidos son "\\" y "\' ".

source: For object properties the same rules apply as to simple variables, though with object properties there doesn 't exist a trick like the one with variables.
es: Esto es por convenio, así que se pueden tener comillas simples y barras invertidas en una cadena entre comillas simples.

source: This results in a parse error. echo "A banana is $fruits['banana'] ."; / / Works echo "A banana is". $fruits['banana']. "."; / / Works echo "This square is $square - width meters broad ."; / / Won't work.
es: Las variables no se expandirán dentro de una cadena entre comillas simples.

source: For anything more complex, you should use the complex syntax.
es: Otra forma de delimitar cadenas es usando la sintaxis de documento incrustado ("").

source: In fact, you can include any value that is in the namespace in strings with this syntax.
es: Se debe proporcionar un identificador después de, después la cadena, y después el mismo identificador para cerrar el entrecomillado.

source: You simply write the expression the same way as you would outside the string, and then include it in {and}.
es: Ejemplo 7-1.

source: Some examples to make it clear:
es: He aquí un ejemplo de entrecomillado de cadenas con sintaxis de documento incrustado

source: This is {fantastic} echo "This is {$great}"; / / Works, outputs:
es: $str = EOD Ejemplo de cadena Expandiendo múltiples líneas usando sintaxis de documento incrustado.

source: In otherwords, it will still work but / / because PHP first looks for a constant named foo, it will / / throw an error of level E_NOTICE (undefined constant). echo "This is wrong: {$arr[foo][3]}"; / / Works.
es: EOD;

source: Characters within strings may be accessed by specifying the zero-based offset of the desired character after the string in curly braces.
es: Nota:

source: However, this syntax is deprecated as of PHP 4.
es: La sintaxis de documento incristado fue añadida en PHP 4.

source: Note that the '+' (addition) operator will not work for this.
es: Las cadenas se pueden concatenar usando el operador '.' (punto).

source: See the string functions section for general functions, the regular expression functions for advanced find replacing (in two tastes:
es: Nótese que el operador '+' (suma) no sirve para esto.

source: There are also functions for URL-strings, and functions to encrypt / decrypt strings (mcrypt and mhash).
es: Por favor mire Operadores de cadena para más información.

source: You can convert a value to a string using the (string) cast, or the strval() You can convert a value to a string using the (string) cast, or the strval() function.
es: Se puede acceder a los caracteres dentro de una cadena tratándola como un array de caracteres indexado numéricamente, usando una sintaxis similar a la de C.

source: String conversion is automatically done in the scope of an expression for you where a string is needed.
es: Vea un ejemplo más abajo.

source: This happens when you use the echo() or print() This happens when you use the echo() or print() functions, or when you compare a variable value to a string.
es: Ejemplo 7-2.

source: See also settype().
es: Algumos ejemplos de cadenas

source: This way you can convert back and forth between boolean and string values.
es: ?php / * Asignando una cadena. * / $str = "Esto es una cadena"; / * Añadiendo a la cadena. * / $str = $str." con algo más de texto"; / * Otra forma de añadir, incluye un carácter de nueva línea protegido. * / $str .= "Y un carácter de nueva línea al final.\n"; / * Esta cadena terminará siendo 'p Número:

source: Arrays are always converted to the string "Array", so you cannot dump out the contents of an array with echo() or print() to see what is inside them.
es: 9 / p '* / $num = 9; $str = "p Número: $num / p"; / * Esta será' p Número: $num / p '* / $num = 9; $str =' p Número: $num / p '; / * Obtener el primer carácter de una cadena * / $str = 'Esto es una prueba .'; $first = $str[0]; / * Obtener el último carácter de una cadena. * / $str = 'Esto es aún una prueba .'; $last = $str[strlen($str)-1];?

source: See below for tips on dumping / viewing the entire contents.
es: Cuando una cadena se evalúa como un valor numérico, el valor resultante y el tipo se determinan como sigue.

source: If you would like to find out the class name of which an object is an instance of, use get_class().
es: La cadena se evaluará como un doble si contiene cualquiera de los caracteres '.', 'e', o 'E'.

source: If you would like to get the type of the resource, use get_resource_type().
es: En caso contrario, se evaluará como un entero.

source: As you can see above, printing out the arrays, objects or resources does not provide you any useful information about the values themselfs.
es: El valor viene dado por la porción inicial de la cadena.

source: You can also convert PHP values to strings to store them permanently.
es: Si la cadena comienza con datos de valor numérico, este será el valor usado.

source: You can also serialize PHP values to XML structures, if you have WDDX support in your PHP setup.
es: En caso contrario, el valor será 0 (cero).

source: The string will evaluate as a float if it contains any of the characters' .', 'e', or'E '.
es: Los datos numéricos válidos son un signo opcional, seguido por uno o más dígitos (que opcionalmente contengan un punto decimal), seguidos por un exponente opcional.

source: If the string starts with valid numeric data, this will be the value used.
es: El exponente es una 'e' o una 'E 'seguidos por uno o más dígitos.

source: Valid numeric data is an optional sign, followed by one or more digits (optionally containing a decimal point), followed by an optional exponent.
es: Cuando la primera expresión es una cadena, el tipo de la variable dependerá de la segunda expresión.

source: ?php $foo = 1 + "10.5"; / / $foo is float (11.5) $foo = 1 + "-1.3e3"; / / $foo is float (-1299) $foo = 1 + "bob-1.3e3"; / / $foo is integer (1) $foo = 1 + "bob3"; / / $foo is integer (1) $foo = 1 + "10 Small Pigs"; / / $foo is integer (11) $foo = 4 + "10.2 Little Piggies"; / / $foo is float (14.2) $foo = "10.0 pigs" + 1; / / $foo is float (11) $foo = "10.0 pigs "+ 1.0; / / $foo is float (11)?
es: $foo = 1 + "10.5"; / / $foo es doble (11.5) $foo = 1 + "-1.3e3"; / / $foo es doble (-1299) $foo = 1 + "bob-1.3e3"; / / $foo es entero (1) $foo = 1 + "bob3"; / / $foo es entero (1) $foo = 1 + "10 Cerditos"; / / $foo es entero (11) $foo = 1 + "10 Cerditos"; / / $foo es entero (11) $foo = "10.0 cerdos" + 1; / / $foo es entero (11) $foo = "10.0 cerdos "+ 1.0; / / $foo es double (11)

source: If you would like to test any of the examples in this section, you can cut and paste the examples and insert the following line to see for yourself what 's going on:
es: Para más información sobre esta conversión, mire en la página del manual de Unix strtod( 3).

source: Do not expect to get the code of one character by converting it to integer (as you would do in C for example).
es: Si quisiera probar cualquiera de los ejemplos de esta sección, puede cortar y pegar los ejemplos e insertar la siguiente línea para ver por sí mismo lo que va ocurriendo:

source: Use the functions ord() and chr() to convert between charcodes and characters.
es: echo "\$foo==$foo; el tipo es". gettype ($foo). "br \n";

source: Floating point numbers
es: Números en punto flotante

source: PHP does not require (or support) explicit type definition in variable declaration; a variable's type is determined by the context in which that variable is used.
es: PHP no requiere (o soporta) la declaración explícita del tipo en la declaración de variables; el tipo de una variable se determina por el contexto en el que se usa esa variable.

source: That is to say, if you assign a string value to variable $var, $var becomes a string.
es: Esto quiere decir que si se asigna un valor de cadena a la variable var, var se convierte en una cadena.

source: If you then assign an integer value to $var, it becomes an integer.
es: Si después se asigna un valor entero a la variable var, se convierte en una variable entera.

source: An example of PHP' s automatic type conversion is the addition operator '+ '.
es: Un ejemplo de conversión de tipo automática en PHP3 es el operador suma '+'.

source: If any of the operands is a float, then all operands are evaluated as floats, and the result will be a float.
es: Si cualquiera de los operandos es un doble, entonces todos los operandos se evalúan como dobles, y el resultado será un doble.

source: Otherwise, the operands will be interpreted as integers, and the result will also be an integer.
es: En caso contrario, los operandos se interpretarán como enteros, y el resultado será también un entero.

source: Note that this does NOT change the types of the operands themselves; the only change is in how the operands are evaluated.
es: Nótese que esto NO cambia los tipos de los operandos propiamente dichos; el único cambio está en cómo se evalúan los operandos.

source: ?php $foo = "0"; / / $foo is string (ASCII 48) !- - bad example, no real operator (must be used with variable, modifies it too) $foo++; / / $foo is the string "1" (ASCII 49) - - $foo += 2; / / $foo is now an integer (2) $foo = $foo + 1.3; / / $foo is now a float (3.3) $foo = 5 + "10 Little Piggies"; / / $foo is integer (15) $foo = 5 + "10 Small Pigs"; / / $foo is integer (15) !- - TODO: explain ++ / - - behaviour with strings examples: ++'001 '= '002' ++'abc '= 'abd' ++'xyz '= 'xza' ++'9.9 '= '9.0' ++'-3 '= '-4' - -'9 '= 8 (integer!) - -'5.5' = '5.5 '- -'-9' = -10 (integer) - -'09 '= 8 (integer) - -'abc' = 'abc '- -?
es: Si los últimos dos ejemplos anteriores parecen confusos, vea Conversión de cadenas.

source: If the last two examples above seem odd, see String conversion to numbers.
es: Si se desea obligar a que una variable sea evaluada con un tipo concreto, mire la sección Forzado de tipos.

source: If you wish to force a variable to be evaluated as a certain type, see the section on Type casting.
es: Si se desea cambiar el tipo de una variable, vea la función settype().

source: If you would like to test any of the examples in this section, you can use the var_dump() function.
es: echo "\$foo==$foo; el tipo es". gettype ($foo). "br \n";

source: The behaviour of an automatic conversion to array is currently undefined.
es: La posibilidad de una conversión automática a array no está definida actualmente.

source: What happens??
es: $a = 1; / / $a es un entero $a[0] = "f"; / / $a se convierte en un array, en el que $a[0] vale "f "

source: Since PHP (for historical reasons) supports indexing into strings via offsets using the same syntax as array indexing, the example above leads to a problem: should $a become an array with its first element being "f", or should "f "become the first character of the string $a?
es: $a = "1"; / / $a es una cadena $a[0] = "f"; / / ¿Qué pasa con los índices de las cadenas? ¿Qué ocurre?

source: PHP 4 introduced the new curly bracket syntax to access characters in string, use this syntax instead of the one presented above:
es: Dado que PHP soporta indexación en las cadenas vía offsets usando la misma sintaxis que la indexación de arrays, el ejemplo anterior nos conduce a un problema: ¿debería convertirse $a en un array cuyo primer elemento sea "f", o debería convertirse "f" en el primer carácter de la cadena $a?

source: Type casting in PHP works much as it does in C: the name of the desired type is written in parentheses before the variable which is to be cast.
es: Los parches se están discutiendo, de todas formas.

source: The casts allowed are:
es: El forzado de tipos en PHP funciona como en C: el nombre del tipo deseado se escribe entre paréntesis antes de la variable a la que se pretende forzar.

source: (bool), (boolean) - cast to boolean
es: $foo = 10; / / $foo es un entero $bar = (double) $foo; / / $bar es un doble

source: (float), (double), (real) - cast to float
es: Los forzados de tipo permitidos son:

source: (string) - cast to string
es: (int), (integer) - fuerza a entero (integer)

source: (object) - cast to object
es: (real), (double), (float) - fuerza a doble (double)

source: Note that tabs and spaces are allowed inside the parentheses, so the following are functionally equivalent:
es: (array) - fuerza a array (array)

source: ?php $foo = (int) $bar; $foo = (int) $bar;?
es: (object) - fuerza a objeto (object)

source: Instead of casting a variable to string, you can also enclose the variable in double quotes.
es: Nótese que las tabulaciones y espacios se permiten dentro de los paréntesis, así que los siguientes ejemplos son funcionalmente equivalentes:

source: ?php $foo = 10; / / $foo is an integer $str = "$foo"; / / $str is a string $fst = (string) $foo; / / $fst is also a string / / This prints out that "they are the same "if ($fst === $str) {echo "they are the same";}?
es: Puede no ser obvio que ocurrirá cuando se fuerce entre ciertos tipos.

source: It may not be obvious exactly what will happen when casting between certain types.
es: Por ejemplo, lo siguiente debería ser tenido en cuenta.

source: Converting to boolean
es: Cuando se fuerza el cambio de un escalar o una variable de cadena a un array, la variable se convertirá en el primer elemento del array:

source: Converting to float
es: $var = 'ciao'; $arr = (array) $var; echo $arr[0]; / / produce la salida 'ciao'

source: Converting to array
es: Cuando se fuerza el tipo de una variable escalar o de una cadena a un objeto, la variable se convertirá en un atributo del objeto; el nombre del atributo será 'scalar ':

source: Converting to resource
es: $var = 'ciao'; $obj = (object) $var; echo $obj - scalar; / / produce la salida 'ciao'

source: Pseudo-types used in this documentation
es: Objetos

source: Chapter 8.
es: Capítulo 8.

source: When a form is submitted to a PHP script, the information from that form is automatically made available to the script.
es: Cuando se envía un formulario a un script PHP, las variables de dicho formulario pasan a estar automáticamente disponibles en el script gracias a PHP.

source: There are many ways to access this information, for example:
es: Por ejemplo, consideremos el siguiente formulario:

source: Example 8-2.
es: Ejemplo 8-1.

source: A simple HTML form
es: Variables de formulario simples

source: form action=" foo.php "method="post" Name: input type="text "name="username" br Email: input type="text "name="email" br input type="submit "name="submit" value="Submit me! "/ form
es: form action=" foo.php3 "method="post" Name: input type="text "name="name" br input type="submit "/ form

source: Some examples are:
es: Cuando es enviado, PHP creará la variable $name, que contendrá lo que sea que se introdujo en el campo Name: del formulario.

source: Accessing data from a simple POST HTML form
es: PHP también maneja arrays en el contexto de variables de formularios, pero sólo en una dimensión.

source: ?php / / Available since PHP 4.1.0 print $_POST[ 'username']; print $_REQUEST['username']; import_request_variables('p', 'p_'); print $p_username; / / Available since PHP 3. print $HTTP_POST_VARS['username']; / / Available if the PHP directive register_globals = on.
es: Se puede, por ejemplo, agrupar juntas variables relacionadas, o usar esta característica para recuperar valores de un campo select input múltiple:

source: As of / / PHP 4.2.0 the default value of register_globals = off. / / Using / relying on this method is not preferred. print $username;?
es: Variables de formulario más complejas

source: GET also applies to the QUERY_STRING (the information after the '?' in an URL).
es: form action=" array.php "method="post" Name: input type="text "name="personal[name]" br Email: input type="text "name="personal[email]" br Beer: br select multiple name="beer[] "option value="warthog" Warthog option value="guinness "Guinness option value="stuttgarter" Stuttgarter Schwabenbräu / select input type="submit "/ form

source: See also $_REQUEST and import_request_variables().
es: Si la posibilidad de PHP de track_vars está activada, ya sea mediante la opción de configuración track_vars o mediante la directiva ?php_track_vars?, las variables enviadas con los métodos POST o GET también se encontrarán en los arrays asociativos globales $HTTP_POST_VARS y $HTTP_GET_VARS.

source: Superglobal arrays, like $_POST and $_GET, became available in PHP 4.1.0
es: Cuando se envía un formulario, es posible usar una imagen en vez del botón submit estándar con una etiqueta como:

source: As shown, before PHP 4.2.0 the default value for register_globals was on.
es: input type=image src=" image.gif "name="sub"

source: The PHP community is encouraging all to not rely on this directive as it' s preferred to assume it's off and code accordingly.
es: Cuando el usuario hace click en cualquier parte de la imagen, el formulario que la acompaña se transmitirá al servidor con dos variables adicionales, sub_x y sub_y.

source: The magic_quotes_gpc configuration directive affects Get, Post and Cookie values.
es: Estas contienen las coordenadas del click del usuario dentro de la imagen.
